# ЗАДАНИЕ 1. Скачайте любой датасет с сайта https://www.kaggle.com/datasets
#
# Загрузите набор данных из CSV-файла в DataFrame.
# Выведите первые 5 строк данных, чтобы получить представление о структуре данных.
# Выведите информацию о данных (.info()) и статистическое описание (.describe()).

import pandas as pd

df = pd.read_csv("dogs-ranking-dataset.csv")

print(f"\n===========================================================")
print(f"ЭТО ПЕРВЫЕ 5 СТРОК ВЫБРАННОГО ДАТА-СЕТА")
print(f"===========================================================")
print(df.head())

print(f"\n===========================================================")
print(f"ЭТО ИНФОРМАЦИЯ О ДАННЫХ ВЫБРАННОГО ДАТА-СЕТА")
print(f"===========================================================")
print(df.info())

print(f"\n===========================================================")
print(f"ЭТО СТАТИСТИЧЕСКОЕ ОПИСАНИЕ ВЫБРАННОГО ДАТА-СЕТА")
print(f"===========================================================")
print(df.describe())